readme updated for flows explanation
